using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.IO;
using System.Xml.Linq;

namespace GameFrst.FloorNames
{
    public class AllFloorNames
    {
        public List<string> AllFloorListNames = new List<string>()
        {
            "1344 8064 ULD",
            "2112 8064 UR",
            "2112 8640 RL",
            "2112 9024 LD",
            "2496 9024 UD",
            "3264 9408 DRL",
            "3264 9024 R",
            "3264 8448 RL",
            "3264 8064 LU",
            "4031 8064 RD",
            "4031 7488 LR", //1й сектр [0-10] 11 штук

            "3647 6720 UD",
            "3263 6720 LD",
            "3264 6336 RL",
            "3264 5952 UR",
            "2496 5952 UD",
            "2112 5952 UL",
            "2112 6336 DR",
            "1728 6336 UD",
            "960 6336 L",
            "960 5952 URL",
            "960 6720 RLD", //2й сектр [11-21] 11 штук

            "4415 6720 UD",
            "4799 6720 RD",
            "4799 6336 RL",
            "4799 5952 LU",
            "5183 5952 UD",
            "6335 5952 UR",
            "6335 6336 RL",
            "6336 7105 LD",
            "6720 7104 UD",
            "7104 7104 UR",
            "7105 7488 RL",
            "7105 7872 LD",
            "7489 7872 URD", // 3й сектр [22-34] 13 штук

            "4031 6720 -",
            "4032 4416 RL",
            "4032 4032 UR", // 4й сектр [35-37] 3 штуки

            "3264 4032 UD",
            "2880 4032 L",
            "2880 4416 RL",
            "2880 4608 DR",
            "2880 2880 RL",
            "1344 4608 UD",
            "576 4032 URL",
            "576 4608 L",
            "576 4800 RLD", // 5й сектр [38-46] 9 штук

            "2880 2496 LU",
            "3264 2496 UD",
            "3840 2496 D",
            "3840 2304 L",
            "4416 2304 U",
            "4800 2304 R",
            "3840 1920 RL",
            "4800 1920 RL",
            "3072 1728 LD",
            "3264 1728 D",
            "3840 1728 -",
            "4416 1728 D",
            "4800 576 UR",
            "4224 576 U",
            "3072 576 UL",
            "4032 1536 -",
            "4032 576 U",
            "4032 768 -",
            "4032 960 L",
            "3648 1536 U",
            "3648 576 UD",
            "3456 1536 -",
            "3456 576 U",
            "3456 960 R", // 6й сектор [47-70] 24 штук

            "5184 2496 UD",
            "6336 2496 UR",
            "6336 2688 D",
            "6528 2688 UD",
            "6912 2688 UR",
            "6912 2880 RL",
            "6912 3648 DL",
            "7104 3648 UD",
            "7296 3648 U",
            "7296 3840 LD" // 7й сектор [71-80] 10 штук
        };
    }
}
